rpruitt76/PLMPLS_41/r_flash_rx/src/non_fcu/rx100/r_flash_rx100_rx.c
/********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014 Renesas Electronics Corporation. All rights reserved.
********************************************************************************************************************/
/*******************************************************************************************************************
* File Name : r_flash_rx.c
* Description  : This module implements the Flash API layer functions for the RX1xx
********************************************************************************************************************/
/*******************************************************************************************************************
* History : DD.MM.YYYY Version Description
*           12.11.2014 1.10    Support for RX110, RX111, RX113
*                              Changed WAIT_MAX_ROM_WRITE to WAIT_MAX_ERASE_DF_1K in flash_api_erase().
********************************************************************************************************************/

/********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
********************************************************************************************************************/
/* Includes board and MCU related header files. */
#include "platform.h"
#ifdef BSP_MCU_RX11_ALL
#include <machine.h>

#include "r_flash_rx_if.h"

/* Private header file for this package. */
#include "r_flash_rx100_if.h"
#include "r_flash_common_rx100.h"
#include "r_dataflash_rx100.h"
#include "r_codeflash_rx100.h"
#include "r_codeflash_extra_rx100.h"

/* include definition for NULL*/
#include <stddef.h>


/*********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/

/*********************************************************************************************************************
 Typedef definitions
 *********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
BSP_CFG_USER_LOCKING_TYPE g_GetStatus_Lock;         // GetStatus command software lock

/*********************************************************************************************************************
 External variables and functions
 *********************************************************************************************************************/
extern flash_states_t g_flash_state;

flash_err_t flash_lock_state (flash_states_t new_state);
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
#pragma section FRAM
#endif

/***********************************************************************************************************************
* Function Name: flash_api_open
* Description  : Function will initialize the flash for the RX100 family.
* Arguments    : void
* Return Value : FLASH_SUCCESS -
*                    API initialized successfully.
*                FLASH_ERR_BUSY
*                    API has already been initialized and another operation is ongoing.
*                FLASH_ERR_FAILURE
*                    Initialization failed.
*                    A RESET was performed on the Flash circuit to rectify any internal errors
***********************************************************************************************************************/
flash_err_t flash_api_open(void)
{

    /* Allow Initialization if not initialized or
     * if no operation is ongoing and re-initialization is desired */
    if ((FLASH_UNINITIALIZED == g_flash_state) || (FLASH_READY == g_flash_state))
    {
        if (FLASH_SUCCESS != flash_lock_state(FLASH_INITIALIZATION))
            {
                /* API already initialized */
                return FLASH_ERR_BUSY;
            }
    }

    /* Release state so other operations can be performed. */
    flash_release_state();

#ifndef BSP_MCU_RX110
    /* Make E2 DataFlash Access enable */
     R_DF_Enable_DataFlashAccess();
#endif

    return FLASH_SUCCESS;
}

/*****************************************************************************
* Function Name: flash_api_control()
* Description  : This function executes RX11 specific flash control commands.
*
* Arguments    : flash_cmd_t cmd -
*                 command.
*                void *pcfg -
*                 Pointer to configuration. This argument can be NULL for
*                 commands that do not require a configuration.
*
*                Command                                |   Argument
*                FLASH_CMD_RESET------------------------| NULL
*                FLASH_CMD_STATUS_GET-------------------| NULL
*                FLASH_CMD_ACCESSWINDOW_SET----------------| void (*pAccessInfo)(void *)
*                FLASH_CMD_ACCESSWINDOW_GET---------------|  void (*pAccessInfo)(void *)
*                FLASH_CMD_SWAPFLAG_TOGGLE----------------| NULL
*                FLASH_CMD_SWAPFLAG_GET---------------| void (*uint32_t)(void *)
*
* Return Value : FLASH_SUCCESS -
*                    Operation completed successfully.
*                FLASH_ERR_FAILURE -
*                    Operation not available for this MCU
*                FLASH_ERR_ADRRESS -
*                    Address is an invalid Code/Data Flash block start address
*                FLASH_ERR_NULL_PTR -
*                    Pointer was NULL for a command that expects a configuration structure
*                FLASH_ERR_BUSY -
*                    Flash peripheral is busy with another operation or not initialized
******************************************************************************/
flash_err_t flash_api_control(flash_cmd_t cmd,  void  *pcfg)
{
    flash_err_t err = FLASH_SUCCESS;
    uint32_t *pSwapInfo = pcfg;
    flash_access_window_config_t  *pAccessInfo = pcfg;

    (void)&pSwapInfo;        /* Prevent compiler warning for not using 'pSwapInfo' AND not generate any code  */
    (void)&pAccessInfo;      /* Prevent compiler warning for not using 'pAccessInfo' AND not generate any code  */

    /*If the command is to reset the Flash, then no attempt is made to grab the lock
     * before executing the reset since the assumption is that the RESET command
     * is used to terminate any existing operation. */
    if (cmd == FLASH_CMD_RESET)
    {
        flash_release_state();
        flash_reset();           // reset the flash circuit
        return err;
    }

    if(g_flash_state != FLASH_READY)
    {
        // There is an operation in progress. If we don't have some form of BGO enabled, then this is an error.
#if (FLASH_CFG_DATA_FLASH_BGO == 0) && (FLASH_CFG_CODE_FLASH_BGO ==0)
       // In blocking mode we will return busy if the flash state is busy no matter what
        return FLASH_ERR_BUSY;  /* API not initialized or busy with another operation*/
#else
        // We are in polling/BGO mode. We may have an operation running in the background.
        // If that's the case then we need to be able to call GetStatus() to kick it along and complete
        // the original started operation. Therefore in this case we need to allow a FLASH_CMD_STATUS_GET
        // even when the g_flash_stat is not ready.
        if (cmd == FLASH_CMD_STATUS_GET)
        {
            // Use a software lock to insure no one sneaks in.
            if (flash_softwareLock(&g_GetStatus_Lock) != true)
                return FLASH_ERR_BUSY;

