rpruitt76/PLMPLS_41/r_flash_rx/src/non_fcu/rx100/r_flash_rx100_rx.c
            err = flash_get_status();
            flash_softwareUnlock(&g_GetStatus_Lock);
            return err;
        }
#endif
     }



    switch (cmd)
    {
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)

    case FLASH_CMD_SWAPFLAG_TOGGLE:                // Inverts the start-up program swap flag
        // This function is available in products with a 32-Kbyte or larger ROM
        if (BSP_ROM_SIZE_BYTES < 32768)
            return FLASH_ERR_FAILURE;
        err = R_CF_ToggleStartupArea();
        break;

    case FLASH_CMD_SWAPFLAG_GET:                   // Returns the the current value of the start-up program swap flag.
#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
        if ((pSwapInfo == NULL) || (pSwapInfo == FIT_NO_PTR))
        {
            return FLASH_ERR_NULL_PTR;
        }
#endif
        // This function is available in products with a 32-Kbyte or larger ROM
         if (BSP_ROM_SIZE_BYTES < 32768)
            return FLASH_ERR_FAILURE;
        *pSwapInfo = R_CF_GetCurrentStartupArea();
    break;

    case FLASH_CMD_SWAPSTATE_GET:                   // Retrieves the current physical state of the start-up program area(which one is active)..
        *pSwapInfo = R_CF_GetCurrentSwapState();

    break;

    case FLASH_CMD_SWAPSTATE_SET:                   // Swaps the start-up program areas without setting the start-up program swap flag.
        R_CF_SetCurrentSwapState((uint8_t)*pSwapInfo);
    break;



        // When providing block numbers, the start address is the larger block number (lower address)
        //        access_info.start_addr =  (uint32_t)FLASH_CF_BLOCK_3;     // ie. This will allow writing block 3
        //        access_info.end_addr =  (uint32_t)(FLASH_CF_BLOCK_2);
        //        access_info.start_addr =  (uint32_t)FLASH_CF_BLOCK_8;     // ie. This will allow writing blocks 3 - 8
        //        access_info.end_addr =  (uint32_t)(FLASH_CF_BLOCK_2);
        //        any address in the block can also be provided, it will map to the Block # in which it lives.
        //        ie. access_info.start_addr = (uint32_t)FLASH_CF_BLOCK_3 = 0xFFFFF000 or 0xFFFFF020, etc

    case FLASH_CMD_ACCESSWINDOW_SET:        // Works on full blocks only. Provide code block numbers or any address within a block
#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
        if ((pAccessInfo == NULL) || (pAccessInfo == FIT_NO_PTR))
        {
            return FLASH_ERR_NULL_PTR;
        }

        if ((pAccessInfo->start_addr > pAccessInfo->end_addr)  ||
            (pAccessInfo->start_addr < (uint32_t)FLASH_CF_LOWEST_VALID_BLOCK) ||
            (pAccessInfo->start_addr >= (uint32_t)FLASH_CF_BLOCK_END)    ||
            (pAccessInfo->end_addr < (uint32_t)FLASH_CF_LOWEST_VALID_BLOCK) ||
            (pAccessInfo->end_addr > (uint32_t)FLASH_CF_BLOCK_END))
            return(FLASH_ERR_ACCESSW);
#endif
        err = R_CF_SetAccessWindow(pAccessInfo);
    break;

    case FLASH_CMD_ACCESSWINDOW_GET:
        if ((pAccessInfo == NULL) || (pAccessInfo == FIT_NO_PTR))
        {
            return FLASH_ERR_NULL_PTR;
        }
        err = R_CF_GetAccessWindow(pAccessInfo);
    break;
#endif

    case FLASH_CMD_STATUS_GET:
        err = flash_get_status();
    break;

    default:
        err = FLASH_ERR_PARAM;
    }
    return err;
}


/*****************************************************************************
* Function Name: flash_api_write()
* Description  : This function executes RX11x specific functionality to write to
*                 the specified Code or Data Flash memory area.
*                Note that this function does not insure that the block(s) being written are blank.
*                If that information is required, R_FLASH_BlankCheck() should be used.
* Arguments    : uint32_t src_address -
*                 Source buffer address (data being written to Flash)
*                uint32_t dest_address -
*                 Destination address.
*                uint32_t num_bytes
*                 Number of bytes to be written
* Return Value : FLASH_SUCCESS -
*                    Write completed successfully; successfully initialized in case of BGO mode.
*                FLASH_ERR_BYTES -
*                    Number of bytes exceeds max range or is 0 or is not a valid multiple of the minimum programming
*                    size for the specified flash
*                FLASH_ERR_ADRRESS -
*                    src/dest address is an invalid Code/Data Flash block start address or
*                    address is not aligned with the minimum programming size for the Code/Data Flash
*                    For Code Flash programming the src address HAS to be a RAM address since ROM cannot be accessed
*                    during Code Flash programming
*                FLASH_ERR_BUSY -
*                    Flash peripheral is busy with another operation or not initialized
*                FLASH_ERR_FAILURE
*                    Flash Write operation failed for some other reason. This can be a result of trying to write to an area
*                    that has been protected via access control.
******************************************************************************/
flash_err_t flash_api_write(uint32_t src_address, uint32_t dest_address, uint32_t num_bytes)
{
    flash_err_t err;

    /*Check if API is busy*/
    if(g_flash_state != FLASH_READY)
    {
        /* API not initialized or busy with another operation*/
        return FLASH_ERR_BUSY;
    }

    /*Grab the current flash state*/
    if (FLASH_SUCCESS != flash_lock_state(FLASH_WRITING))
    {
        /* API busy with another operation*/
        return FLASH_ERR_BUSY;
    }


#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
    if (num_bytes == 0)
    {
        flash_release_state();
        return FLASH_ERR_BYTES;
    }

#endif

#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
    /*Check address validity and that it is on a Code Flash programming boundary*/
    // Ensure start address is valid and on 256 (for CF) byte boundary
    if (((dest_address >= (uint32_t)FLASH_CF_LOWEST_VALID_BLOCK)) &&  (!(dest_address & (FLASH_MIN_PGM_SIZE_CF-1))))
    {
        /*Check if there is enough space in the destination, and that num_bytes is a multiple of programming size*/
        if ((num_bytes-1 + (dest_address) > (uint32_t)FLASH_CF_BLOCK_END) ||
            (num_bytes & (FLASH_MIN_PGM_SIZE_CF-1)) ||
            (num_bytes-1 + (dest_address) < (uint32_t)FLASH_CF_BLOCK_INVALID))        // Overflowed
        {
            err = FLASH_ERR_BYTES;
        }
        else
        {
            /*There are no parameter errors. Switch to the CF PE mode*/
            err = flash_pe_mode_enter(FLASH_TYPE_CODE_FLASH);
            g_current_parameters.current_operation = FLASH_CUR_CF_WRITE;
            g_current_parameters.wait_cnt = WAIT_MAX_ROM_WRITE;
        }

