rpruitt76/PLMPLS_41/r_flash_rx/src/non_fcu/rx100/r_flash_rx100_rx.c
    }
#endif
#ifndef BSP_MCU_RX110       // RX110 has no DF

    /*Check address validity and that it is on a Data Flash programming boundary*/
    else if (((dest_address >= FLASH_DF_BLOCK_0) && (dest_address < FLASH_DF_BLOCK_INVALID ))
            &&
            (!(dest_address & (FLASH_MIN_PGM_SIZE_DF-1))))
    {

        /*Check if there is enough space in the destination, and that num_bytes is a multiple of programming size*/
        if ((num_bytes + (dest_address) > FLASH_DF_BLOCK_INVALID) || (num_bytes & (FLASH_MIN_PGM_SIZE_DF-1)))
        {
            err = FLASH_ERR_BYTES;
        }
        else
        {
            /*There are no parameter errors. Switch to the DF PE mode*/
            err = flash_pe_mode_enter(FLASH_TYPE_DATA_FLASH);
            g_current_parameters.current_operation = FLASH_CUR_DF_WRITE;
            g_current_parameters.wait_cnt = WAIT_MAX_DF_WRITE;
        }

    }
#endif
    else
    {
        err = FLASH_ERR_ADDRESS;
    }

    /*If parameters passed are not valid or there was an error entering PE mode,
     * then release the state and return the error condition*/
    if (FLASH_SUCCESS != err)
    {
        flash_release_state();
        return err;
    }

    /*Write the data*/
    err = flash_write(src_address, dest_address, num_bytes);
    if (FLASH_SUCCESS != err)
    {
        /*If there is an error, then reset the Flash circuit: This will clear error flags and exit the P/E mode*/
        flash_reset();
        /*Release the lock*/
        flash_release_state();
        return err;
    }


    /*If in non-BGO (Blocking) mode, then current operation is completed and the result is in result. Exit from PE mode and return status*/
#if (FLASH_CFG_CODE_FLASH_BGO == 0)
    if (g_current_parameters.current_operation == FLASH_CUR_CF_WRITE)
    {
        /*Return to read mode*/
        err = flash_pe_mode_exit();
        if (FLASH_SUCCESS != err)
        {
            /*Reset the Flash circuit: This will stop any existing processes and exit PE mode*/
            flash_reset();
        }
        /*Release lock and reset the state to Idle*/
        flash_release_state();
    }
#endif

#if (FLASH_CFG_DATA_FLASH_BGO == 0)
    if (g_current_parameters.current_operation == FLASH_CUR_DF_WRITE)
    {
        /*Return to read mode*/
        err = flash_pe_mode_exit();
        if (FLASH_SUCCESS != err)
        {
            /*Reset the Flash circuit: This will stop any existing processes and exit PE mode*/
            flash_reset();
        }
        /*Release lock and reset the state to Idle*/
        flash_release_state();
    }
#endif



    /*If BGO is enabled, then
     *return result of started Write process*/
    return err;
}


/***********************************************************************************************************************
* Function Name: flash_api_erase
* Description  : This function executes RX11x specific functionality to erase the specified Code or Data Flash blocks.
* Arguments    : uint32_t block_start_address -
*                 Start address of the first block. Actual address or entry from "flash_block_address_t" enum can be used
*                 Note - An additional 'feature' of the RX100 is that any address within a block may be specified and the
*                        entire contents of that block will be erased. The address supplied need not be on an Erase boundary
*                        or even an even boundary.
*                uint32_t num_blocks -
*                 Number of blocks to erase.
* Return Value : FLASH_SUCCESS -
*                    Erase completed successfully; successfully initialized in case of BGO mode.
*                FLASH_ERR_BLOCKS -
*                    Number of blocks exceeds max range or is 0
*                FLASH_ERR_ADRRESS -
*                    Start address is an invalid Code/Data Flash block start address
*                FLASH_ERR_BUSY -
*                    Flash peripheral is busy with another operation
*                FLASH_ERR_FAILURE
*                    Flash Write operation failed for some other reason. This can be a result of trying to erase an area
*                    that has been protected via access control.
***********************************************************************************************************************/
flash_err_t flash_api_erase(flash_block_address_t block_start_address, uint32_t num_blocks)
{
    flash_err_t err;

    /*Check if API is busy*/
    if(g_flash_state != FLASH_READY)
    {
        /* API not initialized or busy with another operation*/
        return FLASH_ERR_BUSY;
    }
    /*Grab the current flash state*/
    if (FLASH_SUCCESS != flash_lock_state(FLASH_ERASING))
    {
        /* API busy with another operation*/
        return FLASH_ERR_BUSY;
    }


#ifndef BSP_MCU_RX110       // RX110 has no DF
    if ((block_start_address >= FLASH_DF_BLOCK_0) && (block_start_address < FLASH_DF_BLOCK_INVALID ))
    {
        if ((num_blocks > FLASH_NUM_BLOCKS_DF) ||
            (num_blocks <= 0) ||
            ((num_blocks * FLASH_DF_BLOCK_SIZE)-1  + (block_start_address) >= (uint32_t)FLASH_DF_BLOCK_INVALID))        // Overflowed)
        {
            err = FLASH_ERR_BLOCKS;
        }
        else
        { /*No errors in parameters. Enter Data Flash PE mode*/
            err = flash_pe_mode_enter(FLASH_TYPE_DATA_FLASH);
            g_current_parameters.current_operation = FLASH_CUR_DF_ERASE;
            g_current_parameters.wait_cnt = WAIT_MAX_ERASE_DF_1K;
        }
    }
#endif

#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
#ifndef BSP_MCU_RX110       // RX110 has no DF
    else
#endif

    /*Check address and num_blocks validity and switch to Code Flash or Data Flash P/E mode*/
    if ((block_start_address <= FLASH_CF_BLOCK_0) && (block_start_address >= FLASH_CF_LOWEST_VALID_BLOCK))
    {
        if ((num_blocks >= FLASH_NUM_BLOCKS_CF) ||
            (num_blocks <= 0) ||
            ((num_blocks * FLASH_CF_BLOCK_SIZE)-1  + (block_start_address) < (uint32_t)FLASH_CF_BLOCK_INVALID))        // Overflowed

        {
            err = FLASH_ERR_BLOCKS;
        }
        else
        { /*No errors in parameters. Enter Code Flash PE mode*/
            err = flash_pe_mode_enter(FLASH_TYPE_CODE_FLASH);
            g_current_parameters.current_operation = FLASH_CUR_CF_ERASE;
            g_current_parameters.wait_cnt = WAIT_MAX_ERASE_CF_1K;
        }
    }
#endif
    else
    {
        err = FLASH_ERR_ADDRESS;
    }

    if (FLASH_SUCCESS != err)
    {
        flash_release_state();
        return err;
    }


    /*Erase the Blocks*/
    err = flash_erase((uint32_t)block_start_address, num_blocks);
    if (FLASH_SUCCESS != err)
    {
        /*If there is an error, then reset the Flash circuit: This will clear error flags and exit the P/E mode*/
        flash_reset();
        flash_release_state();
        return err;
    }

    /*If in non-BGO (Blocking) mode, then current operation is completed and the result is in result. Exit from PE mode and return status*/
#if (FLASH_CFG_CODE_FLASH_BGO == 0)
    if (g_current_parameters.current_operation == FLASH_CUR_CF_ERASE)
    {
        /*Return to read mode*/
        err = flash_pe_mode_exit();
        if (FLASH_SUCCESS != err)
        {
            /*Reset the Flash circuit: This will stop any existing processes and exit PE mode*/
            flash_reset();
        }
        /*Release lock and reset the state to Idle*/
        flash_release_state();
    }
#endif

#if (FLASH_CFG_DATA_FLASH_BGO == 0)
    if (g_current_parameters.current_operation == FLASH_CUR_DF_ERASE)
    {
        /*Return to read mode*/
        err = flash_pe_mode_exit();
        if (FLASH_SUCCESS != err)
        {
            /*Reset the Flash circuit: This will stop any existing processes and exit PE mode*/
            flash_reset();
        }
        /*Release lock and reset the state to Idle*/
        flash_release_state();
    }
#endif



    /*If BGO is enabled, then return result of started Erase process*/
    return err;
}



