rpruitt76/PLMPLS_41/r_flash_rx/src/non_fcu/rx100/r_flash_rx100_rx.c
/***********************************************************************************************************************
* Function Name: flash_api_blankcheck
* Description  : This function executes RX11x specific functionality to blank check the specified Flash area.
*                The function will incrementally check the area from the start address onward.
*                The minimum number of bytes is 4 for CF and 1 for DF.
*                The max is 256K for CF, 8192 for DF.
*                For parts that may support > 256K CF, then the address range provided may not span a 256K boundary.
*                For example: with a 512K part one could not specify a range of 255K - 257K even though that is
*                a 2K range. That would require two seperate BlankCheck calls. One for 255-256, one for 256-257
* Arguments    : uint32_t address -
*                 Start address to perform blank check. Actual address or entry from "flash_block_address_t" enum can be used
*                uint32_t num_blocks -
*                 Number of bytes to perform blank check operation for.
*                flash_res_t *result
*                 Returns the result of the blank check operation. This field is valid only in non-BGO mode
*                 operation
* Return Value : FLASH_SUCCESS
*                 Operation was completed successfully
*                FLASH_ERR_BYTES -
*                    Number of bytes exceeds max range (1-65535) or is not a multiple of the minimum
*                    Code or Data programming size.
*                FLASH_ERR_ADRRESS -
*                    Start address is an invalid Data Flash Address
*                FLASH_ERR_BUSY
*                    Flash peripheral is busy with another operation or not initialized
*                FLASH_ERR_FAILURE -
*                    Operation failed for some other reason.*
***********************************************************************************************************************/
flash_err_t flash_api_blankcheck(uint32_t address, uint32_t num_bytes, flash_res_t *result)
{
    flash_err_t err = FLASH_SUCCESS;

    /*Check if API is busy*/
    if(g_flash_state != FLASH_READY)
    {
        /* API not initialized or busy with another operation*/
        return FLASH_ERR_BUSY;
    }

    /*Grab the current flash state*/
    if (FLASH_SUCCESS != flash_lock_state(FLASH_BLANKCHECK))
    {
        /* API busy with another operation*/
        return FLASH_ERR_BUSY;
    }
#ifndef BSP_MCU_RX110       // RX110 has no DF
    if (((address >= FLASH_DF_BLOCK_0) && (address < FLASH_DF_BLOCK_INVALID )))
    {
        /*Check if the range is valid, num_bytes is a multiple of the programming size, is larger than 0 and less than 65536*/
        if (
                ((uint32_t)(num_bytes + address) > FLASH_DF_BLOCK_INVALID) ||
                (num_bytes & (FLASH_MIN_PGM_SIZE_DF-1)) ||
                (num_bytes == 0) ||
                (num_bytes > 8192)
        )
        {
            err = FLASH_ERR_BYTES;
        }
        else
        {
            /*There are no parameter errors. Switch to the CF PE mode*/
            err = flash_pe_mode_enter(FLASH_TYPE_DATA_FLASH);
            g_current_parameters.current_operation = FLASH_CUR_DF_BLANKCHECK;
            g_current_parameters.wait_cnt = WAIT_MAX_BLANK_CHECK;
        }
    }
#endif

#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
#ifndef BSP_MCU_RX110       // RX110 has no DF
    else
#endif
    if (((address <= ((uint32_t)FLASH_CF_BLOCK_0)) && (address >= (uint32_t)(FLASH_CF_LOWEST_VALID_BLOCK))))
    {
#if (BSP_ROM_SIZE_BYTES > 262144L)
        // For parts with ROM > 256K, Blankcheck requests may not span the 256K boundary
        // Is the address in the first 256K?
        if (address < (uint32_t)FLASH_CF_256KBOUNDARY) // for 384 part range is 0xFFFA0000 -  0xFFFFFFFF
        {
            if ((uint32_t)(address + num_bytes) > (uint32_t)FLASH_CF_256KBOUNDARY)
            {
                err = FLASH_ERR_ADRRESS;
            }
        }
       else
#endif
        /*Check if the range is valid, num_bytes is a multiple of 4, is larger than 0 and less than 65536*/
        if (
                ((uint32_t)((num_bytes-1) + address) < (uint32_t)FLASH_CF_LOWEST_VALID_BLOCK) ||
                (num_bytes & (FLASH_MIN_PGM_SIZE_CF-1)) ||
                (num_bytes == 0) ||
                (num_bytes > 0x40000)
        )
        {
            err = FLASH_ERR_BYTES;
        }
        else
        {
            /*There are no parameter errors. Switch to the CF PE mode*/
            err = flash_pe_mode_enter(FLASH_TYPE_CODE_FLASH);
            g_current_parameters.current_operation = FLASH_CUR_CF_BLANKCHECK;
            g_current_parameters.wait_cnt = WAIT_MAX_BLANK_CHECK;
        }
    }
#endif
    else
    {
        err = FLASH_ERR_ADDRESS;
    }


    if (FLASH_SUCCESS != err)
    {
        flash_reset();
        flash_release_state();
        return err;
    }


    /*WAIT_MAX_BLANK_CHECK specifies the wait time for a 4 byte blank check,
     * num_bytes is divided by 4 and then multiplied to calculate the wait time for the entire operation*/
    g_current_parameters.wait_cnt = (WAIT_MAX_BLANK_CHECK * (num_bytes >> 2));


    /*Initialize the result*/
    *result = FLASH_RES_INVALID;

    /*Start the blankcheck operation*/

    err = flash_blankcheck(address, num_bytes, result);
    if (FLASH_SUCCESS != err)
    {
        /*If there is an error, then reset the flash circuit: This will clear error flags and exit the P/E mode*/
        flash_reset();
        flash_release_state();
        return err;
    }

    /*If in non-BGO (Blocking) mode, then current operation is completed and the result is in result. Exit from PE mode and return status*/
#if (FLASH_CFG_CODE_FLASH_BGO == 0)
    if (g_current_parameters.current_operation == FLASH_CUR_CF_BLANKCHECK)
    {
        /*Return to read mode*/
        err = flash_pe_mode_exit();
        if (FLASH_SUCCESS != err)
        {
            /*Reset the Flash circuit: This will stop any existing processes and exit PE mode*/
            flash_reset();
        }
        /*Release lock and reset the state to Idle*/
        flash_release_state();
    }
#endif

#if (FLASH_CFG_DATA_FLASH_BGO == 0)
    if (g_current_parameters.current_operation == FLASH_CUR_DF_BLANKCHECK)
    {
        /*Return to read mode*/
        err = flash_pe_mode_exit();
        if (FLASH_SUCCESS != err)
        {
            /*Reset the Flash circuit: This will stop any existing processes and exit PE mode*/
            flash_reset();
        }
        /*Release lock and reset the state to Idle*/
        flash_release_state();
    }
#endif

    /*If BGO is enabled, then return result of started Erase process*/
    return err;
}


/***********************************************************************************************************
* Function Name: flash_get_status
* Description  : Returns the current state of the flash
*                NOTE1: This function does not have to execute from in RAM. It must be in RAM though if
*                CF BGO is enabled and this function is called during a ROM P/E operation.
* Arguments    : none
* Return Value : FLASH_SUCCESS -
*                    Flash is ready to use
*                FLASH_ERR_BUSY -
*                    Flash is busy with another operation or is uninitialized
***********************************************************************************************************/
flash_err_t flash_get_status (void)
{
    flash_err_t err = FLASH_SUCCESS;

#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)

    if (FLASH_CUR_CF_ERASE  == g_current_parameters.current_operation)
    {
            err = R_CF_Erase_Check();
    }
    else
   if (FLASH_CUR_CF_WRITE  == g_current_parameters.current_operation)
    {
            err = R_CF_Write_Check();
    }
    else
    if (FLASH_CUR_CF_BLANKCHECK  == g_current_parameters.current_operation)
    {
            err = R_CF_BlankCheck_Check();
    }
#endif

#ifndef BSP_MCU_RX110       // RX110 has no DF

    if (FLASH_CUR_DF_ERASE == g_current_parameters.current_operation)
    {
            err = R_DF_Erase_Check();
    }
    else
    if (FLASH_CUR_DF_WRITE  == g_current_parameters.current_operation)
    {
            err = R_DF_Write_Check();
    }
    else
    if (FLASH_CUR_DF_BLANKCHECK  == g_current_parameters.current_operation)
    {
            err = R_DF_BlankCheck_Check();
    }
#endif

 if (err != FLASH_ERR_BUSY)
 {

    /*Release lock and Set current state to Idle*/
    flash_pe_mode_exit();
    flash_release_state();
 }

    return(err);
}

#endif

#pragma section // end FLASH_SECTION_ROM
